Cool_app/app/controllers/artworks_controller.rb

SELECT DISTINCT "artworks".* FROM "artworks" LEFT OUTER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" WHERE (artworks.artist_id = ('1') OR artwork_shares.viewer_id = ('1'))
---
    def index

        @artworks = Artwork.left_outer_joins(:artwork_shares).where("artworks.artist_id = (?) OR artwork_shares.viewer_id = (?)", params[:user_id], params[:user_id]).distinct

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "stevendipietro"], ["image_url", "steve.com"], ["artist_id", 1], ["created_at", "2022-06-30 17:42:12.691850"], ["updated_at", "2022-06-30 17:42:12.691850"]]
---
    def create
        @artwork = Artwork.new(artwork_params)

        if @artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]
---
    def destroy
        @artwork = Artwork.find(params[:id])

        @artwork.destroy