Cool_app/app/controllers/artworkshares_controller.rb

SELECT "artwork_shares".* FROM "artwork_shares"
---
    def index
        @artworkshares = ArtworkShare.all

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["viewer_id", 2], ["created_at", "2022-06-30 18:00:35.301257"], ["updated_at", "2022-06-30 18:00:35.301257"]]
---
    def create
        @artworkshare = ArtworkShare.new(artworkshare_params)
        if @artworkshare.save

SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 6]]
---
    def destroy
        @artworkshare = ArtworkShare.find(params[:id])
        render json: @artworkshare.destroy