Cool_app/app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)

        if @comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["artwork_id", 1], ["body", "this is dope"], ["created_at", "2022-06-30 19:13:13.319233"], ["updated_at", "2022-06-30 19:13:13.319233"]]

    def destroy
        @comment = Comment.find(params[:id])

        render json: @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 5]]