Cool_app/app/controllers/users_controller.rb

    def index
        if params[:username]
            @users = User.where("users.username LIKE '%#{params[:username]}%'")
            @users = User.all if @users.empty?
        else
            @users = User.all
---
SELECT "users".* FROM "users" WHERE (users.username SIMILAR TO 'ckoo')
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE (users.username SIMILAR TO 'ckoo') LIMIT $1  [["LIMIT", 1]]

    def create
        @user = User.new(user_params)
        # debugger
        if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "jonathanz"], ["created_at", "2022-06-30 17:37:58.949721"], ["updated_at", "2022-06-30 17:37:58.949721"]]

    def update
        @user = User.find(params[:id])

        @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Diana"], ["email", "diana@gmail.com"], ["updated_at", "2022-06-29 19:40:13.412150"], ["id", 1]]